Revit 2027 API
ParameterTypeId.ExcludeDesignOptions Property
 "Exclude Design Options" // or "Active Option Only"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ExcludeDesignOptions { get; }
Public Shared ReadOnly Property ExcludeDesignOptions As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ExcludeDesignOptions {
	ForgeTypeId^ get ();
}
static member ExcludeDesignOptions : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace